### Task 2:Exploratory data analysis

In [2]:
import pandas as pd

In [4]:
df= pd.read_csv('books_data.csv')

In [5]:
df.head()

                                   Title    Price Availability
0                   A Light in the Attic  Â£51.77     In stock
1                     Tipping the Velvet  Â£53.74     In stock
2                             Soumission  Â£50.10     In stock
3                          Sharp Objects  Â£47.82     In stock
4  Sapiens: A Brief History of Humankind  Â£54.23     In stock

In [6]:
df.shape

(20, 3)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         20 non-null     object
 1   Price         20 non-null     object
 2   Availability  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes

In [8]:
df.describe()

                       Title    Price Availability
count                     20       20           20
unique                    20       20            1
top     A Light in the Attic  Â£51.77     In stock
freq                       1        1           20

In [9]:
df['Price']=df['Price'].str.replace("Â£","").astype(float)

In [10]:
df['Availability']=df['Availability'].str.lower()

In [11]:
df.head()

                                   Title  Price Availability
0                   A Light in the Attic  51.77     in stock
1                     Tipping the Velvet  53.74     in stock
2                             Soumission  50.10     in stock
3                          Sharp Objects  47.82     in stock
4  Sapiens: A Brief History of Humankind  54.23     in stock

In [12]:
df.isnull().sum()

Title           0
Price           0
Availability    0
dtype: int64

In [13]:
print("Average Price:", round((df["Price"].mean()),2))
print("Max Price:", df["Price"].max())
print("Min Price:", df["Price"].min())

Average Price: 38.05
Max Price: 57.25
Min Price: 13.99

In [14]:
print(df["Availability"].value_counts())

Availability
in stock    20
Name: count, dtype: int64